# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Enhed\Enhed.cydsn\Enhed.cyprj
# Date: Fri, 05 Dec 2014 11:34:48 GMT
#set_units -time ns
create_clock -name {SPIS_1_SCBCLK(FFB)} -period 166.66666666666666 -waveform {0 83.3333333333333} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {ADC_SAR_Seq_0_intClock(FFB)} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/ff_div_7}]]
create_clock -name {CyHFCLK} -period 166.66666666666666 -waveform {0 83.3333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {SPIS_1_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 2 3} [list]
create_generated_clock -name {ADC_SAR_Seq_0_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 5} [list]
create_clock -name {CyIMO} -period 166.66666666666666 -waveform {0 83.3333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 166.66666666666666 -waveform {0 83.3333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]


# Component constraints for C:\Enhed\Enhed.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Enhed\Enhed.cydsn\Enhed.cyprj
# Date: Fri, 05 Dec 2014 11:34:42 GMT
